#### Question 1-

Five functions of Pandas Library are:
1.head()
2.tail()
3.read_csv
4.loc
5.iloc

In [4]:
import pandas as pd

In [5]:
df1=pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [6]:
df1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
df1.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [8]:
df1.loc[0:2,['Name','Sex','Age']]

                                                Name     Sex   Age
0                            Braund, Mr. Owen Harris    male  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                             Heikkinen, Miss. Laina  female  26.0

In [9]:
df1.iloc[0:2,[3,4,5,]]

                                                Name     Sex   Age
0                            Braund, Mr. Owen Harris    male  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0

#### Question 2-

In [ ]:
df.reindex([1,3,5])

#### Question 3-

df['Values'][0:3].sum()

#### Question 4-

In [ ]:
df['Word_Count']=df['Text'].apply(lambda x:len(x.split())

#### Question 5-

Size of a DataFrame is the number of fields in the DataFrame i.e number of rows multiply number of columns.
Whereas, Shape of a DataFrame gives the number of rows and number of columns in the DataFrame.

#### Question 6-

read_excel() function is used to read an excel file in pandas.

#### Question 7-

In [ ]:
df['Username']=df['Email'].apply(lambda x:x[0:x.index('@')])

#### Question 8-

In [33]:
df=pd.DataFrame({'A':[3,8,6,2,9],
                 'B':[5,2,9,3,1],
                 'C':[1,7,4,5,2]})

In [35]:
def test1(x):
    if x>5:
        return x

In [36]:
def test2(x):
    if x<10:
        return x

In [40]:
df3=df['A'].apply(test1)

In [41]:
df4=df['B'].apply(test2)

In [42]:
df3

0    NaN
1    8.0
2    6.0
3    NaN
4    9.0
Name: A, dtype: float64

In [43]:
df4

0    5
1    2
2    9
3    3
4    1
Name: B, dtype: int64

In [52]:
df5=pd.concat([df3,df4],axis=1)

In [53]:
df5

     A  B
0  NaN  5
1  8.0  2
2  6.0  9
3  NaN  3
4  9.0  1

In [54]:
df5.dropna(axis=0,inplace=True)

In [55]:
df5

     A  B
1  8.0  2
2  6.0  9
4  9.0  1

In [56]:
pd.merge(df,df5)

   A  B  C
0  8  2  7
1  6  9  4
2  9  1  2

#### Question 9-

In [ ]:
df['Values'].mean()

In [ ]:
df['Values'].median()

In [ ]:
df['Values'].std()

#### Question 10-

In [ ]:
df['MovingAverage']=df['Sales'].rolling(window=7)+df['Date']

#### Question 11-

In [68]:
df = pd.DataFrame({"Date" : ['2023-01-01' , '2023-01-02','2023-01-03']})

In [69]:
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03

In [74]:
pd.to_datetime(df['Date'])

0   2023-01-01
1   2023-01-02
2   2023-01-03
Name: Date, dtype: datetime64[ns]

In [76]:
df['Date']=pd.to_datetime(df['Date'])

In [77]:
df

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03

In [85]:
df['Weekdays']=df['Date'].dt.strftime("%A")

In [86]:
df

        Date Weekdays
0 2023-01-01   Sunday
1 2023-01-02   Monday
2 2023-01-03  Tuesday

#### Question 12-

In [ ]:
mask=(df['InsertedDates']>start_date) & (df['InsertedDates']<end_date)
df2=df.loc[mask]

#### Question 13

Pandas or NumPy library needs to be installed